print("결과값 : %d" % 10)
print("결과값 : %d, 결과값 : %d" % (10+5, 10-5))
print("결과값 : {:d}".format(10))
print("결과값 : {:d}, 소숫점 : {:f}".format(10,5.123))
#문자와 숫자를 함게 출력이 안 되는데, 이 format, % 를 함께 쓰면 출력 가능 
print("더하기 : {}".format(10+5))
print("덧셈:{}, 뺄셈:{}, 곱셈:{}, 나누기:{:.2f}".format(10+3, 10-3, 10*3, 10/3)) 
# float 
# :.2f (소수점 2자리까지 출력) 
# :10.2f (소수점 총 10자리 중 소수점 2자리까지 출력) 
# 010 = 빈 공백을 0으로 채워줌 
print("덧셈:{}, 뺄셈:{}, 곱셈:{}, 나누기:{:010.2f}".format(10+3, 10-3, 10*3, 10/3)) 
print("번호 : 011")
print("{:03d}".format(10)) 
print("{:3d}".format(10))  
print("{:7d}".format(123456789)) 
print("{:d}, {:.1f}".format(20*3, 20/3)) 
print("{:010d}, {:.1f}".format(20*3, 20/3)) 