# 변수타입 
# 변수 : 값을 저장하는 공간 
# 숫자형타입 (정수형, 실수형), 문자열타입, 불타입 (bool)
# int, float, str, bool
# 정수형 - 1,2,3 소수점 없음
# 실수형 - 1.1, 2.2, 3.3 소수점 있음
# 문자형 - "안녕", "111"
# 불타입 - True, False 대문자 True, False / true, false: 안됨 
# 타입 확인 방법 
# type(변수) - int, float, str, bool 
# 변수 규칙
# 특수 문자 사용할 수 없음 (언더바 "_" 만 가능) 
a= 10
_a = 10
a_1 = 10
# 숫자가 제일 앞에 오는 것은 안 됨
# 1_a = 10 # 에러 명령어 
a_1_2_b = 10 # 제일 끝에 오던지 중간에 오던지 가능 
aBBa = 1
Aa = 1 
a111111 = 1 
# 예약어 사용 불가 
# True = 1 # bool 타입에 넣는 값은 사용할 수 없다 
# if, for 명령어도 변수로 사용 불가 






